<h1> Advanced Aggregation Operations </h1>

* filter
* transform
* apply

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'vars1': [10,23,33,22,11,99],
                   'vars2': [100,253,333,262,111,969]},
                   columns = ['groups', 'vars1', 'vars2'])
df

  groups  vars1  vars2
0      A     10    100
1      B     23    253
2      C     33    333
3      A     22    262
4      B     11    111
5      C     99    969

In [2]:
df.groupby('groups').mean()

        vars1  vars2
groups
A        16.0  181.0
B        17.0  182.0
C        66.0  651.0

In [3]:
df.groupby('groups').aggregate(["min", np.median, max])

       vars1            vars2
         min median max   min median  max
groups
A         10   16.0  22   100  181.0  262
B         11   17.0  23   111  182.0  253
C         33   66.0  99   333  651.0  969

In [4]:
df.groupby('groups').aggregate({'vars1': [min], 'vars2': [max]})

       vars1 vars2
         min   max
groups
A         10   262
B         11   253
C         33   969

<h4> Filter </h4>

In [5]:
def filter_func(x):
    return x['vars1'].std() > 9

In [6]:
df.groupby('groups').filter(filter_func)

  groups  vars1  vars2
2      C     33    333
5      C     99    969

#### Transform

In [7]:
df['vars1']*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: vars1, dtype: int64

In [8]:
df_a = df.iloc[:,1:3]

In [9]:
df_a.transform(lambda x: x - x.mean())

   vars1  vars2
0  -23.0 -238.0
1  -10.0  -85.0
2    0.0   -5.0
3  -11.0  -76.0
4  -22.0 -227.0
5   66.0  631.0

<h4> Apply </h4>

In [11]:
df = pd.DataFrame({
                   'vars1': [10,23,33,22,11,99],
                   'vars2': [100,253,333,262,111,969]},
                   columns = ['groups', 'vars1', 'vars2'])

In [13]:
df.apply(np.sum)

groups       0
vars1      198
vars2     2028
dtype: int64

In [14]:
df.apply(np.mean)

groups      NaN
vars1      33.0
vars2     338.0
dtype: float64

In [15]:
df = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'vars1': [10,23,33,22,11,99],
                   'vars2': [100,253,333,262,111,969]},
                   columns = ['groups', 'vars1', 'vars2'])

In [16]:
df.groupby('groups').apply(np.sum)

       groups  vars1  vars2
groups
A          AA     32    362
B          BB     34    364
C          CC    132   1302